const sharedFeatures = [
	`	Кухненският бокс разполага с пералня, хладилник с физер, кафемашина, ел. кана, напълно оборудвана част за хранене - чинии, чаши, тенджери, тигани и др.`,
	`Всички стаи са климатизирани.`,
	`В хола можете да се насладите на IP телевизия с отлично качество и високоскоростен интернет.`,
]

const sharedImages = [
	`https://www.kraimoriepark.com/img/rooms/r4-8.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-1.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-2.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-3.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-4.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-5.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-6.jpg`,
	`https://www.kraimoriepark.com/img/rooms/r4-7.jpg`,
]

const rooms = {
	"1": {
		id: "1",
		title: "Апартамент с една спалня",
		description: `В апартаментите с една спалня можете да се насладите на уют и отлично функционално разпределение, допълнено от стилно и модерно обзавеждане.
		Апартаментът се състои от една спалня и хол с кухненски бокс, тераса, баня с тоалетна, общата площ е 60 кв. м.`,
		apartmentFeatures: [
			`Капацитетът за настаняване е: максимум 3-ма възрастни или 2-ма възрастни и 2 деца до 10 г.
			Можете да избирате между: 2 единични легла (90/200 см) в спалнята и разтегаем диван в хола или голямо легло (160/200 см) в спалнята и разтегаем диван в хола.`,
			`Кухненският бокс разполага с хладилник с физер, кафемашина, ел. кана, напълно оборудвана част за хранене - чинии, чаши, тенджери, тигани и др.`,
			...sharedFeatures
		],
		images: [
			...sharedImages
		]
	},
	"2": {
		id: "2",
		title: "Апартамент с две спални",
		description: `Просторни и комфортни, с много естествена светлина, апартаментите Ви потапят в атмосфера на релакс и приканват към пълноценна почивка.
		Апартаментът се състои от две спални и хол с кухненски бокс, тераса, баня с тоалетна, тоалетна, общата площ е 100 кв. м.`,
		apartmentFeatures: [
			`Капацитетът за настаняване е: максимум 3-ма възрастни или 2-ма възрастни и 2 деца до 10 г.`,
			`Можете да избирате между: 2 единични легла (90/200 см) в спалнята и разтегаем диван в хола или голямо легло (160/200 см) в спалнята и разтегаем диван в хола.`,
			`Спалня 1 разполага с голямо легло (160/200 см), спалня 2 - с 2 единични легла (90/200 см), както и разтегаем диван в хола.`,
			`Кухненският бокс разполага с хладилник с физер, кафемашина, ел. кана, напълно оборудвана част за хранене - чинии, чаши, тенджери, тигани и др.`,
			...sharedFeatures
		],
		images: [
			...sharedImages
		]
	},
	"3": {
		id: "3",
		title: "ДЕЛУКС Апартамент с една спалня",
		description: `Апартаментите Делукс очароват с простор, елегантен интериор и луксозно обзавеждане.
		Апартаментът се състои от една спалня и хол с кухненски бокс, тераса, баня с тоалетна, общата площ е 60 кв. м. Луксозният и елегантен интериор е изискано допълнен от дизайнерски мебели.`,
		apartmentFeatures: [
			`Капацитетът за настаняване е: максимум 3-ма възрастни или 2-ма възрастни и 2 деца до 10 г.`,
			`Можете да избирате между: 2 единични легла (90/200 см) в спалнята и разтегаем диван в хола или голямо легло (160/200 см) в спалнята и разтегаем диван в хола.`,
			`Кухненският бокс разполага с пералня, хладилник с физер, кафемашина, ел. кана, напълно оборудвана част за хранене - чинии, чаши, тенджери, тигани и др.`,
			...sharedFeatures
		],
		images: [
			...sharedImages
		]
	},
	"4": {
		id: "4",
		title: "ДЕЛУКС Апартамент с две спални",
		description: `Потопете се в луксозната и приятна атмосфера на нашите 2-спални делукс апартаменти, които разполагат с допълнителни удобства, за да бъде престоят Ви възможно най-приятен.`,
		apartmentFeatures: [
			`Апартаментът се състои от две самостоятелни спални и просторен хол с кухненски бокс, тераса, баня с тоалетна, тоалетна, общата площ е 100 кв. м. Дизайнерските мебели в топли цветове създават усещане за домашен уют, а детайлите и акцентите в интериора ще Ви потопят в хармонична атмосфера.`,
			`Капацитетът за настаняване е: максимум 5-ма възрастни или 4-ма възрастни и 2 деца до 10 г.`,
			`Спалня 1 разполага с голямо легло (160/200 см), спалня 2 - с 2 единични легла (90/200 см), както и разтегаем диван в хола.`,
			`Кухненският бокс разполага с пералня, хладилник с физер, кафемашина, ел. кана, напълно оборудвана част за хранене - чинии, чаши, тенджери, тигани и др.`,
			...sharedFeatures
		],
		images: [
			...sharedImages
		]
	},
}

export default rooms;